//Вам нужно запросить у пользователя число. Добавить условие при котором число будет выводиться (через alert) с правильным словом: «год», «года» или «лет». Т.е. «29 лет» или «4 года».

//Ограничений по возрасту — нет, 0 тоже подходит.

//Также сделайте простую проверку, что пользователь ввел число.










//Какие будут результаты выполнения кода и почему, напишите объяснение к каждому примеру:

false && true || true  // FALSE  it happens, cos first point of && is false.That returns false in any way.
false && (true || true);
+'40' + +'2';
'2' + 3 ** 2;
3 ** 2 / 3;
3 ** (9 / 3);
'10' + (5 === 6);
'10' — 5 === 6;
undefined + 1;
(+null == false) < 1;
(+null == false) < 1 ** 5;
let number = 5;
2 * ++number;
2 * number — -;
console.log(number);
